Definition

Index patterns
    logs-windows.sysmon*
Custom query
    sequence by process.pid with maxspan=30s
      [ process where process.name == "cmd.exe" ]
      [ registry where registry.key : "System\\CurrentControlSet\\Services\\*\\UserSettings\\*\\cmd.exe" and winlog.event_data.EventType == "SetValue" ]
      
Rule type
    Event Correlation
Timeline template
    None

Schedule

Runs every
    5m
Additional look-back time
    2m
