{"id":"0c50e660-993c-11ee-8a3c-7d7b18410ee4","updated_at":"2023-12-12T22:32:45.223Z","updated_by":"elastic","created_at":"2023-12-12T22:16:08.545Z","created_by":"elastic","name":"System Discovery by Powershell Command Line","tags":["Powershell","Windows"],"interval":"5m","enabled":true,"revision":3,"description":"Unusual amount of Powershell \"Get - Commands\" in a short time leads to suspect behavior.\nThreshold is not adapted to typical and well-known Powershell scripts like Chocolatey. In case of a high rate of False Positives tune this rule by changing the threshold or create exceptions for several Commands.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://siem.diosen.de/app/security"},"investigation_fields":{"field_names":["host.name","winlog.user.name","winlog.user.domain","user.id"]},"author":["doc"],"false_positives":[],"from":"now-360s","rule_id":"1619ce23-6de6-46ac-bdac-c4f4943cb7d5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"technique":[{"id":"T1082","reference":"https://attack.mitre.org/techniques/T1082","name":"System Information Discovery","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["logs-*"],"query":"powershell.file.script_block_text: GET-*","filters":[],"threshold":{"field":["host.name"],"value":10,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
